// 1. Рекурсия.
// const fib = (n) => {
//   return n > 1 ? fib(n - 1) + fib(n - 2) : n;
// };

// console.log(fib(5));

// 2. Цикл - для больших значений.

const fib = (n) => {
  let a = 1;
  let b = 1;

  for (let i = 2; i < n; i++) {
    let c = a + b;
    a = b;
    b = c;
  }

  return b;
};

// В это случае мы просто смещаем a b c на '1' (где 'а' получает значение 'b', а 'b' - 'c').
// Начинаем с i = 2.
// c = 1 + 1 = 2; a = 1; b = 2;
// c = 1 + 2 = 3; a = 2; b = 3;
// c = 2 + 3 = 5; a = 3; b = 5;
// c = 3 + 5 = 8; a = 5; b = 8;
// c = 5 + 8 = 13; a = 8; b = 13;
// и т.д...

console.log(fib(7));
